benchmark/results/v0.6/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-run2.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 0.989ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.992ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.987ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.997ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.991ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.997ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.995ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04ms  551.78us  10.85ms   72.39%
    Req/Sec     6.36k   439.78     8.78k    75.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.37ms
 90.000%    1.66ms
 99.000%    2.20ms
 99.900%    6.58ms
 99.990%    9.61ms
 99.999%   10.49ms
100.000%   10.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.400     0.100000        96019         1.11
       0.571     0.200000       191467         1.25
       0.722     0.300000       287414         1.43
       0.866     0.400000       383286         1.67
       1.006     0.500000       478541         2.00
       1.076     0.550000       526701         2.22
       1.146     0.600000       574415         2.50
       1.217     0.650000       622444         2.86
       1.290     0.700000       670347         3.33
       1.366     0.750000       717988         4.00
       1.407     0.775000       741986         4.44
       1.450     0.800000       765832         5.00
       1.496     0.825000       789787         5.71
       1.546     0.850000       813599         6.67
       1.602     0.875000       837633         8.00
       1.632     0.887500       849383         8.89
       1.665     0.900000       861264        10.00
       1.701     0.912500       873157        11.43
       1.742     0.925000       885275        13.33
       1.787     0.937500       897258        16.00
       1.812     0.943750       903116        17.78
       1.840     0.950000       909116        20.00
       1.871     0.956250       915103        22.86
       1.905     0.962500       921115        26.67
       1.944     0.968750       927021        32.00
       1.965     0.971875       929949        35.56
       1.991     0.975000       933021        40.00
       2.020     0.978125       935966        45.71
       2.053     0.981250       938957        53.33
       2.093     0.984375       941909        64.00
       2.117     0.985938       943420        71.11
       2.145     0.987500       944963        80.00
       2.177     0.989062       946446        91.43
       2.215     0.990625       947922       106.67
       2.263     0.992188       949383       128.00
       2.293     0.992969       950137       142.22
       2.329     0.993750       950880       160.00
       2.379     0.994531       951620       182.86
       2.445     0.995313       952375       213.33
       2.553     0.996094       953119       256.00
       2.669     0.996484       953489       284.44
       2.859     0.996875       953863       320.00
       3.271     0.997266       954234       365.71
       3.923     0.997656       954608       426.67
       4.639     0.998047       954983       512.00
       5.035     0.998242       955170       568.89
       5.427     0.998437       955357       640.00
       5.775     0.998633       955543       731.43
       6.219     0.998828       955729       853.33
       6.655     0.999023       955916      1024.00
       6.915     0.999121       956010      1137.78
       7.143     0.999219       956103      1280.00
       7.387     0.999316       956198      1462.86
       7.671     0.999414       956290      1706.67
       7.935     0.999512       956383      2048.00
       8.115     0.999561       956430      2275.56
       8.343     0.999609       956477      2560.00
       8.503     0.999658       956523      2925.71
       8.687     0.999707       956570      3413.33
       8.935     0.999756       956619      4096.00
       9.023     0.999780       956641      4551.11
       9.111     0.999805       956666      5120.00
       9.239     0.999829       956688      5851.43
       9.327     0.999854       956710      6826.67
       9.439     0.999878       956734      8192.00
       9.559     0.999890       956745      9102.22
       9.607     0.999902       956757     10240.00
       9.719     0.999915       956769     11702.86
       9.815     0.999927       956780     13653.33
       9.983     0.999939       956792     16384.00
      10.023     0.999945       956798     18204.44
      10.079     0.999951       956805     20480.00
      10.175     0.999957       956810     23405.71
      10.271     0.999963       956816     27306.67
      10.303     0.999969       956823     32768.00
      10.327     0.999973       956825     36408.89
      10.343     0.999976       956827     40960.00
      10.375     0.999979       956831     46811.43
      10.415     0.999982       956833     54613.33
      10.471     0.999985       956836     65536.00
      10.479     0.999986       956838     72817.78
      10.495     0.999988       956840     81920.00
      10.495     0.999989       956840     93622.86
      10.583     0.999991       956842    109226.67
      10.679     0.999992       956843    131072.00
      10.711     0.999993       956844    145635.56
      10.719     0.999994       956845    163840.00
      10.719     0.999995       956845    187245.71
      10.727     0.999995       956846    218453.33
      10.743     0.999996       956847    262144.00
      10.743     0.999997       956847    291271.11
      10.799     0.999997       956849    327680.00
      10.799     0.999997       956849    374491.43
      10.799     0.999998       956849    436906.67
      10.799     0.999998       956849    524288.00
      10.799     0.999998       956849    582542.22
      10.799     0.999998       956849    655360.00
      10.799     0.999999       956849    748982.86
      10.799     0.999999       956849    873813.33
      10.855     0.999999       956850   1048576.00
      10.855     1.000000       956850          inf
#[Mean    =        1.036, StdDeviation   =        0.552]
#[Max     =       10.848, Total count    =       956850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1437655 requests in 30.00s, 160.41MB read
Requests/sec:  47921.70
Transfer/sec:      5.35MB