benchmark/results/v0.6/throughput_mc-vs-rust/RAW/flare_mc-plaintext-throughput_mc-run2.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 2.862ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 2.745ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 2.500ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 2.731ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 3.106ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 2.301ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 2.890ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 1.055ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.35ms   27.68ms 153.86ms   91.72%
    Req/Sec    16.85k   725.13    20.67k    73.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    1.60ms
 90.000%   14.36ms
 99.000%  139.52ms
 99.900%  150.78ms
 99.990%  152.83ms
 99.999%  153.60ms
100.000%  153.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.030     0.000000            1         1.00
       0.458     0.100000       260882         1.11
       0.623     0.200000       519997         1.25
       0.776     0.300000       780919         1.43
       0.925     0.400000      1039907         1.67
       1.089     0.500000      1300657         2.00
       1.179     0.550000      1429720         2.22
       1.276     0.600000      1559752         2.50
       1.380     0.650000      1690711         2.86
       1.487     0.700000      1819694         3.33
       1.603     0.750000      1950576         4.00
       1.666     0.775000      2015045         4.44
       1.736     0.800000      2079450         5.00
       1.819     0.825000      2144936         5.71
       1.925     0.850000      2209729         6.67
       2.089     0.875000      2274704         8.00
       2.261     0.887500      2306954         8.89
      14.359     0.900000      2339367        10.00
      30.399     0.912500      2371882        11.43
      53.023     0.925000      2404360        13.33
      69.439     0.937500      2436898        16.00
      76.927     0.943750      2453189        17.78
      84.415     0.950000      2469454        20.00
      91.903     0.956250      2485610        22.86
      99.391     0.962500      2501842        26.67
     106.943     0.968750      2518182        32.00
     110.655     0.971875      2526311        35.56
     114.559     0.975000      2534391        40.00
     120.255     0.978125      2542460        45.71
     124.927     0.981250      2550709        53.33
     129.471     0.984375      2558724        64.00
     131.711     0.985938      2562956        71.11
     135.167     0.987500      2566917        80.00
     138.367     0.989062      2571086        91.43
     140.287     0.990625      2575148       106.67
     142.079     0.992188      2579089       128.00
     142.975     0.992969      2581049       142.22
     143.999     0.993750      2583200       160.00
     144.895     0.994531      2585189       182.86
     145.919     0.995313      2587363       213.33
     146.815     0.996094      2589341       256.00
     147.327     0.996484      2590422       284.44
     147.711     0.996875      2591248       320.00
     148.223     0.997266      2592371       365.71
     148.607     0.997656      2593205       426.67
     149.119     0.998047      2594273       512.00
     149.375     0.998242      2594770       568.89
     149.759     0.998437      2595419       640.00
     150.015     0.998633      2595822       731.43
     150.399     0.998828      2596303       853.33
     150.911     0.999023      2596881      1024.00
     151.039     0.999121      2597020      1137.78
     151.295     0.999219      2597324      1280.00
     151.551     0.999316      2597666      1462.86
     151.679     0.999414      2597847      1706.67
     151.807     0.999512      2598035      2048.00
     151.935     0.999561      2598210      2275.56
     152.063     0.999609      2598379      2560.00
     152.191     0.999658      2598510      2925.71
     152.319     0.999707      2598645      3413.33
     152.447     0.999756      2598766      4096.00
     152.447     0.999780      2598766      4551.11
     152.575     0.999805      2598885      5120.00
     152.575     0.999829      2598885      5851.43
     152.703     0.999854      2598987      6826.67
     152.703     0.999878      2598987      8192.00
     152.831     0.999890      2599072      9102.22
     152.831     0.999902      2599072     10240.00
     152.831     0.999915      2599072     11702.86
     152.959     0.999927      2599121     13653.33
     153.087     0.999939      2599157     16384.00
     153.087     0.999945      2599157     18204.44
     153.215     0.999951      2599197     20480.00
     153.215     0.999957      2599197     23405.71
     153.343     0.999963      2599233     27306.67
     153.343     0.999969      2599233     32768.00
     153.343     0.999973      2599233     36408.89
     153.343     0.999976      2599233     40960.00
     153.471     0.999979      2599256     46811.43
     153.471     0.999982      2599256     54613.33
     153.471     0.999985      2599256     65536.00
     153.599     0.999986      2599270     72817.78
     153.599     0.999988      2599270     81920.00
     153.599     0.999989      2599270     93622.86
     153.727     0.999991      2599279    109226.67
     153.727     0.999992      2599279    131072.00
     153.727     0.999993      2599279    145635.56
     153.727     0.999994      2599279    163840.00
     153.855     0.999995      2599291    187245.71
     153.855     0.999995      2599291    218453.33
     153.855     0.999996      2599291    262144.00
     153.855     0.999997      2599291    291271.11
     153.855     0.999997      2599291    327680.00
     153.855     0.999997      2599291    374491.43
     153.855     0.999998      2599291    436906.67
     153.855     0.999998      2599291    524288.00
     153.855     0.999998      2599291    582542.22
     153.855     0.999998      2599291    655360.00
     153.855     0.999999      2599291    748982.86
     153.983     0.999999      2599294    873813.33
     153.983     1.000000      2599294          inf
#[Mean    =        9.349, StdDeviation   =       27.680]
#[Max     =      153.856, Total count    =      2599294]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3909523 requests in 30.00s, 436.22MB read
Requests/sec: 130319.88
Transfer/sec:     14.54MB